In [1]:
import pandas as pd
from pandas import Series, DataFrame

# 5.1 Introduction to pandas Data Structures

In [6]:
obj = pd.Series([4, 7, -5, 3])

In [7]:
print(pd.Series([1,2,3,4,5]))

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [8]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [9]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [10]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [11]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])

In [12]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [13]:
obj2.values, obj2.index

(array([ 4,  7, -5,  3], dtype=int64),
 Index(['d', 'b', 'a', 'c'], dtype='object'))

In [14]:
obj2[['c','a', 'd']]

c    3
a   -5
d    4
dtype: int64

In [15]:
obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [16]:
obj2*2

d     8
b    14
a   -10
c     6
dtype: int64

In [17]:
import numpy as np
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [18]:
'b' in obj2

True

In [19]:
sdata = {'Ohio': 35000, 
         'Texas': 71000, 
         'Oregon': 16000, 
         'Utah': 5000
        }

In [20]:
obj3 = pd.Series(sdata)

In [21]:
obj3.values

array([35000, 71000, 16000,  5000], dtype=int64)

In [22]:
obj3 = pd.Series(sdata)

In [23]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [24]:
obj2 = [1, 2, 3, 4, 5]
obj2 = pd.Series(obj2,index=['a','b','c','d','e'])

In [25]:
obj2.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [26]:
obj2.values

array([1, 2, 3, 4, 5], dtype=int64)

In [27]:
obj2['a']

1

In [28]:
obj2 * 5

a     5
b    10
c    15
d    20
e    25
dtype: int64

In [29]:
import numpy as np
np.exp(obj2)

a      2.718282
b      7.389056
c     20.085537
d     54.598150
e    148.413159
dtype: float64

In [30]:
'a' in obj2

True

In [31]:
sdata = {'Ohio': 35000,
         'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [38]:
obj3  = pd.Series(sdata)

In [32]:
sdata = {'ohio':35000, 'Texas':71000, 'Oregon':16000, 'Utah':5000}

In [33]:
obj3 = pd.Series(sdata)

In [34]:
obj3

ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [39]:
obj4 = pd.Series(sdata, index=['California''Texas','Oregon','Utah', 'ohio'])

In [41]:
pd.isnull(obj4)

CaliforniaTexas     True
Oregon             False
Utah               False
ohio               False
dtype: bool

In [42]:
pd.notnull(obj4)

CaliforniaTexas    False
Oregon              True
Utah                True
ohio                True
dtype: bool

In [43]:
obj4.isnull()

CaliforniaTexas     True
Oregon             False
Utah               False
ohio               False
dtype: bool

In [44]:
obj3

ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [45]:
obj4

CaliforniaTexas        NaN
Oregon             16000.0
Utah                5000.0
ohio               35000.0
dtype: float64

In [46]:
obj3 + obj4

CaliforniaTexas        NaN
Oregon             32000.0
Texas                  NaN
Utah               10000.0
ohio               70000.0
dtype: float64

In [47]:
obj4.name = 'Population'
obj4.index.name = 'State'

In [48]:
obj4

State
CaliforniaTexas        NaN
Oregon             16000.0
Utah                5000.0
ohio               35000.0
Name: Population, dtype: float64

In [49]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [51]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [52]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [2]:
data = {'state':['ohio', 'ohio', 'ohio', 'nevada', 'nevada', 'nevada'],
       'year':[2000, 2001, 2002, 2001, 2002, 2003],
       'pop':[1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [71]:
frame = pd.DataFrame(data)
frame

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  nevada  2001  2.4
4  nevada  2002  2.9
5  nevada  2003  3.2

In [84]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four','five', 'six'])

In [85]:
frame2

       year   state  pop debt
one    2000    ohio  1.5  NaN
two    2001    ohio  1.7  NaN
three  2002    ohio  3.6  NaN
four   2001  nevada  2.4  NaN
five   2002  nevada  2.9  NaN
six    2003  nevada  3.2  NaN

In [87]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [90]:
frame2

       year   state  pop debt
one    2000    ohio  1.5  NaN
two    2001    ohio  1.7  NaN
three  2002    ohio  3.6  NaN
four   2001  nevada  2.4  NaN
five   2002  nevada  2.9  NaN
six    2003  nevada  3.2  NaN

In [91]:
frame2['state']

one        ohio
two        ohio
three      ohio
four     nevada
five     nevada
six      nevada
Name: state, dtype: object

In [93]:
frame['year']

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [96]:
frame2.loc['three']

year     2002
state    ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [6]:
frame2 = pd.DataFrame(data, 
          columns=['year', 'state', 'pop', 'debt'],
          index=['one', 'two', 'three', 'four',
                'five', 'six'])

In [8]:
data

{'state': ['ohio', 'ohio', 'ohio', 'nevada', 'nevada', 'nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [14]:
data = {'state': ['MP', 'UP', 'Bihar',
                  'West Bengal'],
       'Cities': ['Gaya', 'Patna',
                  'Jharkhand', 'India'],
       'Pop': [1.1, 1.2, 3.2, 4.1]}

pd.DataFrame(data, columns=['state', 
                            'Cities', 'Pop'],
            index=['one', 'two', 'three', 
                   'four'])

             state     Cities  Pop
one             MP       Gaya  1.1
two             UP      Patna  1.2
three        Bihar  Jharkhand  3.2
four   West Bengal      India  4.1

In [44]:
data = {'names':['Hello','Imran','How','Are','you'],
        'city' :['Gaya', 'Bihar', 'Patna',
                 'Channai', 'Beijing'],
        'places':['Gm','Bs','Rail','Sb','hello'],
        'pop':[2.13, 4.123, 4.11, 12.1, 1.11]
       }

In [45]:
frame = pd.DataFrame(data, columns=['names','city','places','pop', 'debt', 'silver'],
            index=[1, 2, 3, 4, 5])

In [46]:
data1 = pd.Series(data)

In [47]:
frame.names

1    Hello
2    Imran
3      How
4      Are
5      you
Name: names, dtype: object

In [50]:
frame2.loc['one']

year     2000
state    ohio
pop       1.5
debt      NaN
Name: one, dtype: object

In [51]:
frame2['state']

one        ohio
two        ohio
three      ohio
four     nevada
five     nevada
six      nevada
Name: state, dtype: object

In [52]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [53]:
val = pd.Series([-1.2, -1.5, -1.7], 
                index=['two', 'four', 'five'])

In [55]:
frame2['debt'] = val

In [59]:
print(frame2['pop'])

one      1.5
two      1.7
three    3.6
four     2.4
five     2.9
six      3.2
Name: pop, dtype: float64

In [60]:
frame2['eastern'] = frame2.state == 'ohio'

In [63]:
del frame2['eastern']

In [64]:
frame2

       year   state  pop  debt
one    2000    ohio  1.5   NaN
two    2001    ohio  1.7  -1.2
three  2002    ohio  3.6   NaN
four   2001  nevada  2.4  -1.5
five   2002  nevada  2.9  -1.7
six    2003  nevada  3.2   NaN

In [65]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [68]:
frame2.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [35]:
pop = {'nevada': {2001: 2.4, 2002: 2.9},
        'ohio': {2000: 2.2, 2001: 1.7, 2002: 3.6}
        }

In [36]:
frame3 = pd.DataFrame(pop)

In [37]:
frame3

      nevada  ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   2.2

In [38]:
frame3 = pd.DataFrame(pop, index=[2000, 2001, 2002])

In [39]:
frame3.T

        2000  2001  2002
nevada   NaN   2.4   2.9
ohio     2.2   1.7   3.6

In [40]:
pdata = {'ohio': frame3['ohio'][:-1],
         'nevada': frame3['nevada'][:2]}

In [41]:
frame3

      nevada  ohio
2000     NaN   2.2
2001     2.4   1.7
2002     2.9   3.6

In [94]:
pd.Series(pdata)

ohio      2000    2.2
2001    1.7
Name: ohio, dtype: flo...
nevada    2000    NaN
2001    2.4
Name: nevada, dtype: f...
dtype: object

In [95]:
pd.DataFrame(pdata)

      ohio  nevada
2000   2.2     NaN
2001   1.7     2.4

In [42]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [43]:
frame3

state  nevada  ohio
year
2000      NaN   2.2
2001      2.4   1.7
2002      2.9   3.6

In [44]:
frame3.values

array([[nan, 2.2],
       [2.4, 1.7],
       [2.9, 3.6]])

In [105]:
#After Page 133

In [1]:
import pandas as pd
import numpy as np

In [2]:
obj = pd.Series([0, 1, 2], index=['a', 'b', 'c'])

In [7]:
obj.values[0] = 10

In [16]:
labels = pd.Index(np.arange(3))

In [14]:
labels = [1, 2, 3]

In [17]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [28]:
labels = pd.Index(['a','b', 'c'])
obj2 = pd.Series([1.5, -3.0, 0], index=labels)

In [34]:
obj2.index is labels

True

In [50]:
frame3.columns

Index(['nevada', 'ohio'], dtype='object', name='state')

In [52]:
'ohio' in frame3.columns

True

In [54]:
2002 in frame3.index

True

In [57]:
dup_labels = ['foo', 'bar', 'bar']

In [58]:
frame3.index = dup_labels

# 5.2 Essential Functionality

In [62]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [63]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [64]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [1]:
import pandas as pd
import numpy as np

In [2]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [4]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [5]:
obj3 = pd.Series(['blue', 'purple', 'green'], index=[0, 2, 4])
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4     green
5     green
dtype: object

In [8]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)), 
        index=['a','c','d'], columns=['Ohio', 'Texas', 'California'])

In [9]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                    index=['a', 'c', 'd'], 
                    columns=['Ohio', 'Texas', 'California'])

In [10]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [20]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
            index=['a', 'c', 'd'],
             columns=['Ohio', 'Texas', 'California'])

In [23]:
frame2  = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [27]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [34]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [41]:
frame.loc[['a', 'd' ],['Ohio',  'California']]

   Ohio  California
a     0           2
d     6           8

In [42]:
frame.index

Index(['a', 'c', 'd'], dtype='object')

In [57]:
x = pd.DataFrame(np.arange(9).reshape((3,3)),
                index=[0, 2, 4],columns=states)
x.reindex(range(6), method='bfill')

   Texas  Utah  California
0    0.0   1.0         2.0
1    3.0   4.0         5.0
2    3.0   4.0         5.0
3    6.0   7.0         8.0
4    6.0   7.0         8.0
5    NaN   NaN         NaN

In [64]:
x.head()

   Texas  Utah  California
0      0     1           2
2      3     4           5
4      6     7           8

# Dropping Entries from an Axis

In [65]:
obj = pd.Series(np.arange(5.),index=['a', 'b', 'c', 'd', 'e'])

In [67]:
obj.tail()

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [68]:
new_obj = obj.drop('c')

In [69]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [70]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [71]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [72]:
data = pd.DataFrame(np.arange(16).reshape(4, 4),
                   index=['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])

In [77]:
data.drop(index=['Ohio'],columns=['one'])

          two  three  four
Colorado    5      6     7
Utah        9     10    11
New York   13     14    15

In [80]:
obj.drop('c',inplace=True)

In [81]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

# Indexing, Selection, and Filtering

In [82]:
obj = pd.Series(np.arange(4),index=['a', 'b', 'c', 'd']
               )

In [83]:
obj

a    0
b    1
c    2
d    3
dtype: int32

In [86]:
obj[obj < 2]

a    0
b    1
dtype: int32

In [87]:
obj[2:4]

c    2
d    3
dtype: int32

In [96]:
obj[[0, 3]]

a    0
d    3
dtype: int32

In [98]:
obj['a':'b']

a    0
b    1
dtype: int32

In [100]:
obj[0:2] = 2

In [101]:
obj

a    2
b    2
c    2
d    3
dtype: int32

In [103]:
data = pd.DataFrame(np.arange(16).reshape(4, 4),
                   index=['Ohio','Colorado','Utah','N-York'],
                   columns=['one','two','three','four'])

In [104]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
N-York     12   13     14    15

In [111]:
data['one']

Ohio         0
Colorado     4
Utah         8
N-York      12
Name: one, dtype: int32

In [112]:
data[['three','four']]

          three  four
Ohio          2     3
Colorado      6     7
Utah         10    11
N-York       14    15

In [118]:
data[0:4]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
N-York     12   13     14    15

In [126]:
data[:3]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11

In [127]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
N-York    False  False  False  False

In [43]:
import numpy as np
import pandas as pd


data = pd.DataFrame(np.arange(1,17).reshape((4, 4)),
                    index=['Ohio','Colorado','Utah','N-York'],
                   columns=['one','two','three','four'],dtype='float64')
data.columns

Index(['one', 'two', 'three', 'four'], dtype='object')

In [44]:
print(data)

           one   two  three  four
Ohio       1.0   2.0    3.0   4.0
Colorado   5.0   6.0    7.0   8.0
Utah       9.0  10.0   11.0  12.0
N-York    13.0  14.0   15.0  16.0

# Selection with loc and iloc

In [45]:
data.loc['Colorado',['two','three']]

two      6.0
three    7.0
Name: Colorado, dtype: float64

In [46]:
data.loc['Utah',['one','four']]

one      9.0
four    12.0
Name: Utah, dtype: float64

In [47]:
data.iloc[:1,:2]

      one  two
Ohio  1.0  2.0

In [50]:
data.loc['Utah',['one','two']]

one     9.0
two    10.0
Name: Utah, dtype: float64

In [53]:
data.iloc[1,[0,2]]

one      5.0
three    7.0
Name: Colorado, dtype: float64

In [54]:
data.loc[['Utah','Colorado'],['one','two']]

          one   two
Utah      9.0  10.0
Colorado  5.0   6.0

In [55]:
data.iloc[[0,2],[0,1]]

      one   two
Ohio  1.0   2.0
Utah  9.0  10.0

In [57]:
data.iloc[::2,::2]

      one  three
Ohio  1.0    3.0
Utah  9.0   11.0

In [61]:
data.iloc[0,[0,1,2,3]]

one      1.0
two      2.0
three    3.0
four     4.0
Name: Ohio, dtype: float64

In [64]:
data.iloc[2,3]

12.0

In [65]:
data

           one   two  three  four
Ohio       1.0   2.0    3.0   4.0
Colorado   5.0   6.0    7.0   8.0
Utah       9.0  10.0   11.0  12.0
N-York    13.0  14.0   15.0  16.0

In [66]:
data.loc[:'Utah', 'two']

Ohio         2.0
Colorado     6.0
Utah        10.0
Name: two, dtype: float64

In [81]:
data.iloc[:,:][data.four > 7]

           one   two  three  four
Colorado   5.0   6.0    7.0   8.0
Utah       9.0  10.0   11.0  12.0
N-York    13.0  14.0   15.0  16.0

In [98]:
ser = pd.Series(np.arange(3.))

In [99]:
ser[1]

1.0

In [100]:
ser.index

RangeIndex(start=0, stop=3, step=1)

In [101]:
ser[:1]

0    0.0
dtype: float64

In [103]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

# Arithmetic and Data Alignment

In [1]:
import pandas as pd
import numpy as np

In [2]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], 
               index=['a','c','d','e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
              index=['a','c','e','f','g'])

In [3]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [6]:
df1 = pd.DataFrame(np.arange(9.).reshape((3,3)),
                  index=['Ohio','Texas', 'Colorado'],
                  columns=list('bcd'))
df2 = pd.DataFrame(np.arange(12.).reshape((4,3)),
                  index=['Utah', 'Ohio','Texas','Oregon'],
                  columns=list('bde'))

In [8]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [9]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [15]:
Non = df1+df2

In [17]:
Non

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [18]:
df1 = pd.DataFrame({'A':[1, 2]})

In [19]:
df1

   A
0  1
1  2

In [21]:
df2 = pd.DataFrame({'B':[3, 4]})

In [22]:
df2

   B
0  3
1  4

In [23]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                  columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4,5)),
                  columns=list('abcde'))

In [24]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [25]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [26]:
df2.loc[1, 'b'] = np.nan
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [27]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [28]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [30]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [37]:
1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [36]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [41]:
df1.rmul(df2,fill_value=1)

      a     b      c      d     e
0   0.0   1.0    4.0    9.0   4.0
1  20.0   5.0   42.0   56.0   9.0
2  80.0  99.0  120.0  143.0  14.0
3  15.0  16.0   17.0   18.0  19.0

In [44]:
df1.reindex(columns=list('abc'), fill_value=0)

     a    b     c
0  0.0  1.0   2.0
1  4.0  5.0   6.0
2  8.0  9.0  10.0

# Operations between DataFrame and Series

In [1]:
import numpy as np
import pandas as pd

In [11]:
arr = np.arange(12.).reshape((3, 4))
print (arr)

[[ 0.  1.  2.  3.]
 [ 4.  5.  6.  7.]
 [ 8.  9. 10. 11.]]

In [12]:
arr[0]

array([0., 1., 2., 3.])

In [13]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [14]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                    columns=list('bde'),
                    index=['Utah','Ohio','Texas','Oregon'])

In [15]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [50]:
series = frame.iloc[0]

In [51]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [52]:
frame.iloc[:2,:2]

        b    d
Utah  0.0  1.0
Ohio  3.0  4.0

In [53]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [54]:
series.name = 'Utah'

In [55]:
frame-series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [56]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [57]:
series2 = pd.Series(range(3),
                   index=list('bef'))

In [58]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [59]:
series3= frame['d']

In [60]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [62]:
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [64]:
print(frame)
print("\n\n")
print(series3)

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0



Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [65]:
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

# Function Application and Mapping

In [1]:
import numpy as np
import pandas as pd

In [2]:
frame = pd.DataFrame(np.random.randn(4, 3), 
                    columns=list('bde'),
                    index=['Utah','Ohio','Texas','Oregon'] )

In [11]:
frame

               b         d         e
Utah    0.442097 -0.179934  0.837877
Ohio    1.947063 -0.307207 -0.601383
Texas  -0.020857 -1.176169  0.557602
Oregon  0.555322 -0.008199 -0.459939

In [10]:
np.abs(frame)

               b         d         e
Utah    0.442097  0.179934  0.837877
Ohio    1.947063  0.307207  0.601383
Texas   0.020857  1.176169  0.557602
Oregon  0.555322  0.008199  0.459939

In [15]:
f = lambda x: x.max() - x.min()
frame.apply((lambda x: x.max() + x.min()))

b    1.926206
d   -1.184368
e    0.236494
dtype: float64

In [18]:
frame.apply(f, axis=1)

Utah      1.017811
Ohio      2.548446
Texas     1.733771
Oregon    1.015261
dtype: float64

In [23]:
def f(x):
    return pd.Series([x.min(), x.max(),],
                    index=['min','max'])

In [24]:
frame.apply(f)

            b         d         e
min -0.020857 -1.176169 -0.601383
max  1.947063 -0.008199  0.837877

In [26]:
frame

               b         d         e
Utah    0.442097 -0.179934  0.837877
Ohio    1.947063 -0.307207 -0.601383
Texas  -0.020857 -1.176169  0.557602
Oregon  0.555322 -0.008199 -0.459939

In [29]:
frame.apply(f, axis=1)

             min       max
Utah   -0.179934  0.837877
Ohio   -0.601383  1.947063
Texas  -1.176169  0.557602
Oregon -0.459939  0.555322

In [38]:
format = lambda x: '%.2f' % x
frame.applymap(format)

            b      d      e
Utah     0.44  -0.18   0.84
Ohio     1.95  -0.31  -0.60
Texas   -0.02  -1.18   0.56
Oregon   0.56  -0.01  -0.46

In [39]:
frame['e'].map(format)

Utah       0.84
Ohio      -0.60
Texas      0.56
Oregon    -0.46
Name: e, dtype: object

In [40]:
frame['e'].map(format)

Utah       0.84
Ohio      -0.60
Texas      0.56
Oregon    -0.46
Name: e, dtype: object

# Sorting and Ranking

In [41]:
obj = pd.Series(range(4),
               index=list('dabc'))

In [46]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [47]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                    index=['three','one'],
                    columns=list('dabc'))

In [49]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [53]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                    index=['three','one'],
                    columns=list('dabc'))

In [55]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [61]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [78]:
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [87]:
frame.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [90]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [92]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [94]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [96]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [97]:
obj.sort_index()

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [98]:
frame = pd.DataFrame({'b':[4, 7, -3, 2],
                     'a': [0, 1, 0, 1]})

In [102]:
frame = pd.DataFrame({'a': [4, 7, -3, 2],
                     'b': [0, 1, 0, 1]})

In [108]:
frame.sort_index(axis=0,ascending=False)

   a  b
3  2  1
2 -3  0
1  7  1
0  4  0

In [112]:
frame['a']

0    4
1    7
2   -3
3    2
Name: a, dtype: int64

In [113]:
frame['b']

0    0
1    1
2    0
3    1
Name: b, dtype: int64

In [118]:
frame.sort_values(by=['a','b'])

   a  b
2 -3  0
3  2  1
0  4  0
1  7  1

In [123]:
frame.sort_index(axis=1 ,ascending=False)

   b  a
0  0  4
1  1  7
2  0 -3
3  1  2

In [126]:
frame.sort_values(by='a')

   a  b
2 -3  0
3  2  1
0  4  0
1  7  1

In [127]:
#    155
#    To sort by multiple columns, 
#    pass a list of names:
#

In [1]:
import pandas as pd
import numpy as np

In [2]:
obj = pd.Series([4, np.nan, 17, np.nan, -3, 2])

In [3]:
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [4]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [6]:
frame  = pd.DataFrame({'b':[4, 7, -3, 2],
                      'a': [0, 1, 0, 1]})

In [9]:
frame.sort_values(by=['b','a'])

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [10]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [13]:
obj.sort_values().rank()

1    1.0
5    2.0
4    3.0
3    4.5
6    4.5
0    6.5
2    6.5
dtype: float64

In [17]:
print(obj)
obj.rank(method='first')

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [24]:
obj.rank(ascending=False, method='first')

0    1.0
1    7.0
2    2.0
3    3.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [25]:
frame = pd.DataFrame({'b':[4.3, 7, -3, 2],
                     'a':[0, 1, 0, 1],
                     'c':[-2, 5, 8, -2.5]})

In [33]:
frame.rank(ascending=False, method='min',
           axis='index')

     b    a    c
0  2.0  3.0  3.0
1  1.0  1.0  2.0
2  4.0  3.0  1.0
3  3.0  1.0  4.0

# Axis Indexes with Duplicate Labels

In [34]:
obj = pd.Series(range(5), 
               index=['a','a','b','b','c'])

In [35]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [38]:
obj.index.is_unique

False

In [45]:
obj['a':'b']

a    0
a    1
b    2
b    3
dtype: int64

In [40]:
obj['c']

4

In [55]:
df = pd.DataFrame(np.random.randn(4, 3),
                 index=['a','a','b','b'])
df.loc['a']

          0         1         2
a  0.564820  0.399802 -1.209441
a  1.531483  0.635160 -0.412199

#  5.3 Summarizing and Computing Descriptive Statistics

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame([[1.4, np.nan],[7.1, -4.5],
                   [np.nan,np.nan],[0.75, -1.3]],
                  index=list('abcd'),
                  columns=['one','two'])

In [15]:
df.sort_index()

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [18]:
df.mean(axis='columns',skipna='False')

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [13]:
df.sum(axis=1, skipna='False')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [22]:
df.mean(axis=0,skipna=0)

one   NaN
two   NaN
dtype: float64

In [35]:
df.idxmin(axis=1)

a    one
b    two
c    NaN
d    two
dtype: object

In [36]:
df.idxmax()

one    b
two    d
dtype: object

In [38]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [39]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [43]:
obj = pd.Series(['a','a','b','c']*4,dtype=str)

In [44]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [48]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [50]:
df.count(1)

a    1
b    2
c    0
d    2
dtype: int64

In [53]:
df.min(),df.max()

(one    0.75
 two   -4.50
 dtype: float64,
 one    7.1
 two   -1.3
 dtype: float64)

# Correlation and Covariance

In [62]:
conda install pandas-datareader

Collecting package metadata (current_repodata.json): ...working... done
Note: you may need to restart the kernel to use updated packages.
Solving environment: ...working... done

## Package Plan ##

  environment location: C:\Users\HP\anaconda3

  added / updated specs:
    - pandas-datareader


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    conda-4.10.3               |   py38haa95532_0         2.9 MB
    pandas-datareader-0.10.0   |     pyhd3eb1b0_0          71 KB
    ------------------------------------------------------------
                                           Total:         2.9 MB

The following NEW packages will be INSTALLED:

  pandas-datareader  pkgs/main/noarch::pandas-datareader-0.10.0-pyhd3eb1b0_0

The following packages will be SUPERSEDED by a higher-priority channel:

  conda              conda-forge::conda-4.10.3-py38haa244f~ --> pkgs/main::conda-4.10.3-py38haa95532_0



Downloading and Extracting Packages

pandas-datareader-0. | 71 KB     |            |   0%
pandas-datareader-0. | 71 KB     | ##2        |  22%
pandas-datareader-0. | 71 KB     | ########9  |  90%
pandas-datareader-0. | 71 KB     | ########## | 100%

conda-4.10.3         | 2.9 MB    |            |   0%
conda-4.10.3         | 2.9 MB    |            |   1%
conda-4.10.3         | 2.9 MB    | 1          |   2%
conda-4.10.3         | 2.9 MB    | 2          |   3%
conda-4.10.3         | 2.9 MB    | 3          |   4%
conda-4.10.3         | 2.9 MB    | 4          |   5%
conda-4.10.3         | 2.9 MB    | 5          |   6%
conda-4.10.3         | 2.9 MB    | 7          |   7%
conda-4.10.3         | 2.9 MB    | 8          |   8%
conda-4.10.3         | 2.9 MB    | 9          |   9%
conda-4.10.3         | 2.9 MB    | #          |  11%
conda-4.10.3         | 2.9 MB    | #1         |  12%
conda-4.10.3         | 2.9 MB    | #3         |  13%
conda-4.10.3         | 2.9 MB    | #4         |  14%
conda-4.10.3         | 2.9 MB    | #5         |  15%
conda-4.10.3         | 2.9 MB    | #6         |  16%
conda-4.10.3         | 2.9 MB    | #7         |  17%
conda-4.10.3         | 2.9 MB    | #8         |  19%
conda-4.10.3         | 2.9 MB    | #9         |  20%
conda-4.10.3         | 2.9 MB    | ##1        |  21%
conda-4.10.3         | 2.9 MB    | ##2        |  23%
conda-4.10.3         | 2.9 MB    | ##4        |  25%
conda-4.10.3         | 2.9 MB    | ##6        |  26%
conda-4.10.3         | 2.9 MB    | ##7        |  28%
conda-4.10.3         | 2.9 MB    | ##9        |  29%
conda-4.10.3         | 2.9 MB    | ###1       |  31%
conda-4.10.3         | 2.9 MB    | ###2       |  33%
conda-4.10.3         | 2.9 MB    | ###4       |  34%
conda-4.10.3         | 2.9 MB    | ###5       |  36%
conda-4.10.3         | 2.9 MB    | ###7       |  38%
conda-4.10.3         | 2.9 MB    | ###9       |  39%
conda-4.10.3         | 2.9 MB    | ####       |  41%
conda-4.10.3         | 2.9 MB    | ####3      |  43%
conda-4.10.3         | 2.9 MB    | ####4      |  45%
conda-4.10.3         | 2.9 MB    | ####6      |  47%
conda-4.10.3         | 2.9 MB    | ####8      |  48%
conda-4.10.3         | 2.9 MB    | #####      |  51%
conda-4.10.3         | 2.9 MB    | #####2     |  52%
conda-4.10.3         | 2.9 MB    | #####4     |  54%
conda-4.10.3         | 2.9 MB    | #####6     |  57%
conda-4.10.3         | 2.9 MB    | #####8     |  59%
conda-4.10.3         | 2.9 MB    | ######     |  61%
conda-4.10.3         | 2.9 MB    | ######3    |  63%
conda-4.10.3         | 2.9 MB    | ######4    |  65%
conda-4.10.3         | 2.9 MB    | ######6    |  67%
conda-4.10.3         | 2.9 MB    | ######8    |  69%
conda-4.10.3         | 2.9 MB    | #######    |  70%
conda-4.10.3         | 2.9 MB    | #######1   |  72%
conda-4.10.3         | 2.9 MB    | #######3   |  74%
conda-4.10.3         | 2.9 MB    | #######5   |  75%
conda-4.10.3         | 2.9 MB    | #######6   |  77%
conda-4.10.3         | 2.9 MB    | #######8   |  78%
conda-4.10.3         | 2.9 MB    | ########   |  80%
conda-4.10.3         | 2.9 MB    | ########1  |  82%
conda-4.10.3         | 2.9 MB    | ########2  |  83%
conda-4.10.3         | 2.9 MB    | ########3  |  84%
conda-4.10.3         | 2.9 MB    | ########4  |  85%
conda-4.10.3         | 2.9 MB    | ########6  |  87%
conda-4.10.3         | 2.9 MB    | ########8  |  88%
conda-4.10.3         | 2.9 MB    | ########9  |  89%
conda-4.10.3         | 2.9 MB    | #########  |  90%
conda-4.10.3         | 2.9 MB    | #########1 |  91%
conda-4.10.3         | 2.9 MB    | #########3 |  93%
conda-4.10.3         | 2.9 MB    | #########4 |  95%
conda-4.10.3         | 2.9 MB    | #########6 |  96%
conda-4.10.3         | 2.9 MB    | #########8 |  98%
conda-4.10.3         | 2.9 MB    | #########9 | 100%
conda-4.10.3         | 2.9 MB    | ########## | 100%
Preparing transaction: ...working... done
Verifying transaction: ...working... done
Executing transaction: ...working... done

In [63]:
import pandas_datareader as web

In [67]:
all_data = {ticker: web.get_data_yahoo(ticker)
           for ticker in 
            ['AAPL', 'IBM', 'MSFT', 'GOOG']}

In [77]:
price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})

In [81]:
volume = pd.DataFrame({ticker: data['Volume']
                      for ticker, data in all_data.items()})

In [83]:
returns = price.pct_change()

In [88]:
returns.tail(10,)

                AAPL       IBM      MSFT      GOOG
Date
2021-09-03  0.004230 -0.003071 -0.000033  0.003855
2021-09-07  0.015489 -0.010890 -0.003188  0.005139
2021-09-08 -0.010084  0.004418  0.000100 -0.004367
2021-09-09 -0.006705 -0.006707 -0.009860  0.000207
2021-09-10 -0.033102 -0.005227 -0.005181 -0.020650
2021-09-13  0.003893  0.008247  0.004329  0.010879
2021-09-14 -0.009562 -0.013970  0.009428 -0.000411
2021-09-15  0.006144  0.007194  0.016778  0.012552
2021-09-16 -0.001610 -0.005612  0.001312 -0.005733
2021-09-17 -0.018348 -0.008796 -0.017528 -0.020156

In [95]:
returns['MSFT'].corr(returns['IBM'])

0.515180198910359

In [96]:
returns['MSFT'].cov(returns['IBM'])

0.0001446594794754491

In [98]:
returns.MSFT.corr(returns.IBM)

0.515180198910359

In [100]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.441866  0.736296  0.663414
IBM   0.441866  1.000000  0.515180  0.482616
MSFT  0.736296  0.515180  1.000000  0.773878
GOOG  0.663414  0.482616  0.773878  1.000000

In [101]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000360  0.000137  0.000240  0.000212
IBM   0.000137  0.000267  0.000145  0.000133
MSFT  0.000240  0.000145  0.000295  0.000224
GOOG  0.000212  0.000133  0.000224  0.000283

In [104]:
returns.corrwith(volume, 1)

Date
2016-09-19         NaN
2016-09-20   -0.160015
2016-09-21   -0.557674
2016-09-22    0.166199
2016-09-23   -0.901586
                ...
2021-09-13   -0.739637
2021-09-14   -0.256180
2021-09-15   -0.374682
2021-09-16    0.503750
2021-09-17   -0.336171
Length: 1259, dtype: float64

# Unique Values, Value Counts, and Membership

In [106]:
obj = pd.Series(['c','a','d','a','a','b','b','c','c'])

In [108]:
uniques = obj.unique()

In [113]:
uniques, obj.value_counts()

(array(['c', 'a', 'd', 'b'], dtype=object),
 a    3
 c    3
 b    2
 d    1
 dtype: int64)

In [117]:
pd.value_counts(obj.values, sort=False)

a    3
c    3
b    2
d    1
dtype: int64

In [122]:
mask = obj.isin(['b','c'])

In [123]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [124]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [126]:
to_match = pd.Series(['c','a','b','b','c','a'])
unique_vals = pd.Series(['c','b','a'])
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [130]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})

In [131]:
data['Qu1']

0    1
1    3
2    4
3    3
4    4
Name: Qu1, dtype: int64

In [137]:
result = data.apply(pd.value_counts).fillna('aa')

In [138]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2   aa  2.0  1.0
3  2.0  2.0   aa
4  2.0   aa  2.0
5   aa   aa  1.0